[String]
IDS_MENU_PROJECT      = 工程
IDS_MENU_PROJECT_NEW  = 新建工程
IDS_MENU_PROJECT_OPEN = 打开工程
IDS_MENU_PROJECT_SAVE = 保存工程
IDS_MENU_EXIT         = 退出

IDS_MENU_FILE         = 文件
IDS_MENU_FILE_ADD     = 添加文件
IDS_MENU_FILE_MODIFY  = 编辑文件路径
IDS_MENU_FILE_REMOVE  = 移除文件

IDS_MENU_PROTECT      = 保护
IDS_MENU_PROTECT_CUR  = 保护当前文件
IDS_MENU_PROTECT_ALL  = 保护全部文件

IDS_MENU_LANG         = 语言

IDS_MENU_VIEW         = 视图
IDS_MENU_VIEW_TOOL    = 工具栏
IDS_MENU_VIEW_STATUS  = 状态栏

IDS_MENU_HELP         = 帮助
IDS_MENU_HELP_ABOUT   = 关于

IDS_STATUS_PROJECT_NEW  = 创建一个新的工程
IDS_STATUS_PROJECT_OPEN = 打开已有的工程文件
IDS_STATUS_PROJECT_SAVE = 保存工程
IDS_STATUS_EXIT         = 退出本程序
IDS_STATUS_FILE_ADD     = 添加要保护的文件
IDS_STATUS_FILE_MODIFY  = 修改文件的路径
IDS_STATUS_FILE_REMOVE  = 从列表中移除文件
IDS_STATUS_PROTECT_CUR  = 保护当前文件
IDS_STATUS_PROTECT_ALL  = 保护全部文件
IDS_STATUS_VIEW_TOOL    = 显示或隐藏工具栏
IDS_STATUS_VIEW_STATUS  = 显示或隐藏状态栏
IDS_STATUS_ABOUT        = 查看本程序的版本与版权等信息

IDS_MAINFRM_ERRTITLE           = 错误
IDS_MAINFRM_HADRUN             = 程序已经在运行了!
IDS_MAINFRM_STR1               = 程序运行缺少必要的文件!
IDS_MAINFRM_STR2               = 调用加壳进程失败!
IDS_MAINFRM_UNSUPPORT_WIN32PE  = 当前加密锁不支持Win32PE程序加壳
IDS_MAINFRM_UNSUPPORT_WIN64PE  = 当前加密锁不支持Win64PE程序加壳
IDS_MAINFRM_UNSUPPORT_WIN32NET = 当前加密锁不支持Win32 .NET程序加壳
IDS_MAINFRM_UNSUPPORT_WIN64NET = 当前加密锁不支持Win64 .NET程序加壳
IDS_MAINFRM_PACKED             = 此程序可能已被加过壳, 再次加壳可能导致不能运行

IDS_LISTVIEW_COLUMN_1   = 序号
IDS_LISTVIEW_COLUMN_2   = 类型
IDS_LISTVIEW_COLUMN_3   = 输入文件
IDS_LISTVIEW_COLUMN_4   = 输出文件
IDS_LISTVIEW_COLUMN_5   = 结果
IDS_LISTVIEW_STR1       = 成功
IDS_LISTVIEW_STR2       = 失败
IDS_LISTVIEW_WIN32PE      = PE32
IDS_LISTVIEW_WIN64PE      = PE64
IDS_LISTVIEW_WIN32DOTNET  = .Net32
IDS_LISTVIEW_WIN64DOTNET  = .Net64
IDS_LISTVIEW_WIN32DP_DATA = DATA32
IDS_LISTVIEW_WIN64DP_DATA = DATA64

IDS_DIALOG_TYPE_TITLE      = 类型选择
IDS_DIALOG_TYPE_STR1       = 请选择所用的加密锁类型
IDS_DIALOG_DONGLE_ET99     = ET99、ET99 Time、ET299
IDS_DIALOG_DONGLE_ET199    = ET199
IDS_DIALOG_TYPE_BTN_OK     = 确定
IDS_DIALOG_TYPE_BTN_CANCEL = 取消

IDS_DIALOG_FILE_TITLE        = 文件路径
IDS_DIALOG_FILE_STR1         = 输入文件:
IDS_DIALOG_FILE_STR2         = 输出文件:
IDS_DIALOG_FILE_STR3         = 要保护的文件类型:
IDS_DIALOG_FILE_STR4         = 错误
IDS_DIALOG_FILE_STR5         = 请输入待加壳文件的路径
IDS_DIALOG_FILE_STR6         = 请输入加壳后的文件保存的路径
IDS_DIALOG_FILE_STR7         = 程序
IDS_DIALOG_FILE_STR8         = 数据
IDS_DIALOG_FILE_BTN_OK       = 确定
IDS_DIALOG_FILE_BTN_CANCEL   = 取消

IDS_DIALOG_METHOD_TITLE        = 选择需要加密的函数
IDS_DIALOG_METHOD_BTN_OK       = 确定
IDS_DIALOG_METHOD_BTN_CANCEL   = 取消
IDS_DIALOG_METHOD_ERR1         = 您必须至少选择一个方法进行加密
 
IDS_DIALOG_ABOUT_TITLE     = 关  于
IDS_DIALOG_ABOUT_STR1      = 产  品:
IDS_DIALOG_ABOUT_STR2      = 版  本:
IDS_DIALOG_ABOUT_STR3      = 公  司:
IDS_DIALOG_ABOUT_STR4      = 网  站:
IDS_DIALOG_ABOUT_STR5      = 外壳保护中心

IDS_SHELLOPTION_PE_TITLE      = PE 外壳选项
IDS_SHELLOPTION_PE_ITEM1      = 反调试
IDS_SHELLOPTION_PE_DESC1      = 是否启用外壳的反调试功能
IDS_SHELLOPTION_PE_ITEM2      = 检查父进程
IDS_SHELLOPTION_PE_DESC2      = 是否启用外壳的父进程检查
IDS_SHELLOPTION_PE_ITEM3      = 指令替换
IDS_SHELLOPTION_PE_DESC3      = 是否启用外壳的指令替换功能，以增加外壳的强度
IDS_SHELLOPTION_PE_ITEM4      = 启用数据文件保护
IDS_SHELLOPTION_PE_DESC4      = 是否启用外壳的数据文件保护功能
IDS_SHELLOPTION_YES           = 是
IDS_SHELLOPTION_NO            = 否

IDS_SHELLOPTION_NET_TITLE     = .NET 外壳选项
IDS_SHELLOPTION_NET_ITEM1     = 算法选择
IDS_SHELLOPTION_NET_DESC1     = 请选择相应的加密算法
IDS_SHELLOPTION_NET_ITEM2     = 重置强名称
IDS_SHELLOPTION_NET_DESC2     = 是否重置强名称
IDS_SHELLOPTION_NET_ITEM3     = 创建新的强文件
IDS_SHELLOPTION_NET_DESC3     = 是否创建新的强文件
IDS_SHELLOPTION_NET_ITEM4     = 强文件名
IDS_SHELLOPTION_NET_DESC4     = 请输入强文件名
IDS_SHELLOPTION_NET_ITEM5     = 加密BLOB数据
IDS_SHELLOPTION_NET_DESC5     = 是否加密BLOB数据
IDS_SHELLOPTION_NET_ITEM6     = 加密字符串
IDS_SHELLOPTION_NET_DESC6     = 是否加密字符串
IDS_SHELLOPTION_NET_ITEM7     = 加密资源段
IDS_SHELLOPTION_NET_DESC7	    = 是否加密资源段
IDS_SHELLOPTION_NET_ITEM8     = 加密方法体
IDS_SHELLOPTION_NET_DESC8	    = 是否加密方法体
IDS_SHELLOPTION_NET_ITEM9     = 方法列表
IDS_SHELLOPTION_NET_DESC9     = 点击右边的按钮可选择所需加密的方法
IDS_SHELLOPTION_NET_ENCALL    = 全部加密
IDS_SHELLOPTION_NET_ENCSOME   = 部分加密
IDS_SHELLOPTION_NET_ENCNOTHING= 未加密

IDS_SHELLOPTION_DPD_TITLE     = 数据保护选项
IDS_SHELLOPTION_DPD_ITEM1     = 算法选择
IDS_SHELLOPTION_DPD_DESC1     = 请选择相应的加密算法
IDS_SHELLOPTION_DPD_ITEM2     = 平台选择
IDS_SHELLOPTION_DPD_DESC2     = 请选择此数据文件被调用的平台

IDS_ET99_MSG_TITLE   = 错误
IDS_ET99_MSG_NOKEY   = 找不到指定的加密锁
IDS_ET99_MSG_PINERR  = 加密锁用户PIN码校验失败
IDS_ET99_MSG_EXPIRE  = 加密锁时间授权已过期
IDS_ET99_MSG_RTCSTOP = 加密锁内实时钟已停走
IDS_ET99_NAME_1      = 产品ID
IDS_ET99_DESC_1      = 请输入加密锁的产品ID,即PID
IDS_ET99_NAME_2      = 用户PIN码
IDS_ET99_DESC_2      = 请输入加密锁的用户PIN码,加壳后请勿更改,否则会导致加壳后的程序不能运行
IDS_ET99_NAME_3      = 绑定HID
IDS_ET99_DESC_3      = 是否绑定加密锁的硬件ID
IDS_ET99_NAME_4      = HID
IDS_ET99_DESC_4      = 请输入要绑定的锁硬件ID
IDS_ET99_NAME_5      = 启用后台定时检测
IDS_ET99_DESC_5      = 是否启用加密锁后台定时检测
IDS_ET99_NAME_6      = 时间间隔(秒)
IDS_ET99_DESC_6      = 请输入后台定时检测的周期,单位是秒
IDS_ET99_NAME_7      = 信息标题
IDS_ET99_DESC_7      = 请输入错误提示信息的标题
IDS_ET99_NAME_8      = 找不到锁的提示信息
IDS_ET99_DESC_8      = 请输入找不到加密锁时的错误提示信息
IDS_ET99_NAME_9      = 用户PIN码校验失败的提示信息
IDS_ET99_DESC_9      = 加完壳之后请勿再更改加密锁的用户PIN码,否则将导致此错误的发生
IDS_ET99_NAME_10     = 时间授权已过期的提示信息
IDS_ET99_DESC_10     = 请输入时间授权过期时的错误提示信息
IDS_ET99_NAME_11     = 锁内实时钟已停走的提示信息
IDS_ET99_DESC_11     = 请输入锁内实时钟因电池失效而停走的错误提示信息

IDS_ET199_MSG_TITLE   = 错误
IDS_ET199_MSG_NOKEY   = 找不到指定的加密锁
IDS_ET199_NAME_1      = 客户号
IDS_ET199_DESC_1      = 请输入加密锁的客户号
IDS_ET199_NAME_2      = 绑定HID
IDS_ET199_DESC_2      = 是否绑定加密锁的硬件ID
IDS_ET199_NAME_3      = HID
IDS_ET199_DESC_3      = 请输入要绑定的锁硬件ID
IDS_ET199_NAME_4      = 启用后台定时检测
IDS_ET199_DESC_4      = 是否启用加密锁后台定时检测
IDS_ET199_NAME_5      = 时间间隔(秒)
IDS_ET199_DESC_5      = 请输入后台定时检测的周期,单位是秒
IDS_ET199_NAME_6      = 信息标题
IDS_ET199_DESC_6      = 请输入错误提示信息的标题
IDS_ET199_NAME_7      = 找不到锁的提示信息 
IDS_ET199_DESC_7      = 请输入找不到加密锁时的错误提示信息

